{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "b_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "nb_filter": 24, "dim_ordering": "tf", "b_constraint": null, "activation": "elu", "batch_input_shape": [null, 66, 200, 3], "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "nb_col": 5, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "nb_filter": 36, "dim_ordering": "tf", "b_constraint": null, "activation": "elu", "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "nb_col": 5, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "nb_filter": 48, "dim_ordering": "tf", "b_constraint": null, "activation": "elu", "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "nb_col": 5, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "activation": "elu", "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "activation": "elu", "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "nb_col": 3, "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activation": "elu", "batch_input_shape": [null, 1152], "W_constraint": null, "input_dim": 1152, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1164, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activation": "elu", "batch_input_shape": [null, 1164], "W_constraint": null, "input_dim": 1164, "W_regularizer": null, "activity_regularizer": null, "output_dim": 100, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "activation": "elu", "batch_input_shape": [null, 100], "W_constraint": null, "input_dim": 100, "W_regularizer": null, "activity_regularizer": null, "output_dim": 50, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "b_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "activation": "elu", "batch_input_shape": [null, 50], "W_constraint": null, "input_dim": 50, "W_regularizer": null, "activity_regularizer": null, "output_dim": 10, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "b_regularizer": null, "name": "output", "init": "glorot_uniform", "activation": "linear", "batch_input_shape": [null, 10], "W_constraint": null, "input_dim": 10, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "trainable": true}}], "keras_version": "1.2.1"}