{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "name": "convolution2d_1", "b_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "nb_col": 5, "W_constraint": null, "input_dtype": "float32", "b_constraint": null, "bias": true, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "nb_col": 5, "W_constraint": null, "b_constraint": null, "bias": true, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "nb_col": 5, "W_constraint": null, "b_constraint": null, "bias": true, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 3, "W_constraint": null, "b_constraint": null, "bias": true, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "name": "convolution2d_5", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 3, "W_constraint": null, "b_constraint": null, "bias": true, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "elu", "W_constraint": null, "name": "dense_1", "b_regularizer": null, "bias": true, "input_dim": 1152, "b_constraint": null, "output_dim": 1164, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "elu", "W_constraint": null, "name": "dense_2", "b_regularizer": null, "bias": true, "input_dim": 1164, "b_constraint": null, "output_dim": 100, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "elu", "W_constraint": null, "name": "dense_3", "b_regularizer": null, "bias": true, "input_dim": 100, "b_constraint": null, "output_dim": 50, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "elu", "W_constraint": null, "name": "dense_4", "b_regularizer": null, "bias": true, "input_dim": 50, "b_constraint": null, "output_dim": 10, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "W_constraint": null, "name": "output", "b_regularizer": null, "bias": true, "input_dim": 10, "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}]}